# 5.	Программа запрашивает у пользователя строку чисел, разделённых пробелом.
# При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделённых пробелом и снова нажать Enter.
# Сумма вновь введённых чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введён после нескольких чисел,
# то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.


numbers = []
while True:
    num_input = (input('Введите последовательность чисел, через пробел (для остановки, введите "!" ): ').split(' '))  # Вводим список через пробел
    if num_input[-1] == '!':
        try:
            for el in num_input:
                numbers.append(int(el))  # Преобразуем элементы списка в числовые
        except:
            print('Ваша последовательность: ', numbers)
            print(f'Сумма чисел последовательности = {sum(numbers)}')
            print('Остановка программы')
            break
    else:

        for el in num_input:
            numbers.append(int(el))  # Преобразуем элементы списка в числовые
        print('Ваша последовательность: ', numbers)
        print(f'Сумма чисел последовательности = {sum(numbers)}')