# 4.	Программа принимает действительное положительное число x и целое отрицательное число y.
# Выполните возведение числа x в степень y.
# Задание реализуйте в виде функции my_func(x, y).
# При решении задания нужно обойтись без встроенной функции возведения числа в степень.

# Первый — возведение в степень с помощью оператора **.
a = 2
b = -4

def my_func_1(x, y):
    if y >= 0:
        print(f'Значение переменной Y должно быть меньше 0, сейчас оно равно {y}')
        return
    print(f'1-ый способ: {x} в степени {y} = {x ** y}')
    return x ** y


my_func_1(a, b)

# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.
def my_func_2(x, y):
    i = 1
    result = x
    if y >= 0:
        print(f'Значение переменной Y должно быть меньше 0, сейчас оно равно {y}')
        return
    while i < abs(y):
        i +=1
        result *= x
    print(f'2-ой способ: {x} в степени {y} = {1/result}')
    return 1/result


my_func_2(a, b)

# Третий способ, через встроенную функцию
print(f'3-ий способ: {a} в степени {b} = {pow(a,b)}')
