# 4.	Представлен список чисел. Определите элементы списка, не имеющие повторений.
# Сформируйте итоговый массив чисел, соответствующих требованию.
# Элементы выведите в порядке их следования в исходном списке.
# Для выполнения задания обязательно используйте генератор.
# Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
# Результат: [23, 1, 3, 10, 4, 11]

numbers = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]

# 1ый способ
numbers_uniq = [el for el in numbers if numbers.count(el) == 1]
print(numbers_uniq)

# 2ой способ через словарь
my_dict = {}
uniq_list = []
for el in numbers:
    if el not in my_dict:
        my_dict[el] = 1
    else:
        my_dict[el] += 1
for x in my_dict:
    if my_dict[x] == 1:
        uniq_list.append(x)

print(uniq_list)
