# Сформировать (не программно) текстовый файл.
# В нём каждая строка должна описывать учебный предмет и наличие лекционных,
# практических и лабораторных занятий по предмету.
# Сюда должно входить и количество занятий. Необязательно,
# чтобы для каждого предмета были все типы занятий.
# Сформировать словарь, содержащий название предмета и общее количество занятий по нему.
# Вывести его на экран.
# Примеры строк файла: Информатика:   100(л)   50(пр)   20(лаб).
#                                         Физика:   30(л)   —   10(лаб)
#                                         Физкультура:   —   30(пр)   —
# Пример словаря: {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

with open('task_06_file.txt', 'r') as import_file:
    new_dict = {}
    for el in import_file:
        print(el.strip())
        new_str = el.strip().replace('(л)', '').replace('(пр)', '').replace('(лаб)', '').replace('   ', ' ').replace('—', '0').replace(':', '').split(' ')
        sum_str = (int(new_str[1])+int(new_str[2])+int(new_str[3]))
        new_dict[new_str[0]] = sum_str
    print('')
    print(new_dict)
