# 2.	Для списка реализовать обмен значений соседних элементов.
# Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т. д.
# При нечётном количестве элементов последний сохранить на своём месте.
# Для заполнения списка элементов нужно использовать функцию input().


numbers = []

list_n = int(input('Ведите количество элементов списка: '))

for el in range(list_n):
    el_n = int(input(f'Введите {el + 1}-й элемент списка: '))
    numbers.append(el_n)

print('Исходный список: ', numbers)

i = 0

while i < len(numbers):
    pop_el = numbers.pop(i)
    numbers.insert(i + 1, pop_el)
    i += 2

print('Измененный список: ', numbers)
