# 6.	*Реализовать структуру данных «Товары». Она должна представлять собой список кортежей.
# Каждый кортеж хранит информацию об отдельном товаре.
# В кортеже должно быть два элемента — номер товара и словарь с параметрами,
# то есть характеристиками товара: название, цена, количество, единица измерения.
# Структуру нужно сформировать программно, запросив все данные у пользователя.
# Пример готовой структуры:
# [
#     (1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
#     (2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
#     (3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
# ]
# Нужно собрать аналитику о товарах.
# Реализовать словарь, в котором каждый ключ — характеристика товара, например, название.
# Тогда значение — список значений-характеристик, например, список названий товаров.
#
# Пример:
# {
#     “название”: [“компьютер”, “принтер”, “сканер”],
#     “цена”: [20000, 6000, 2000],
#     “количество”: [5, 2, 7],
#     “ед”: [“шт.”]
# }

# goods = [
#     (1, {'название': 'компьютер', 'цена': 20000, 'количество': 5, 'eд': 'шт.'}),
#     (2, {'название': 'принтер', 'цена': 6000, 'количество': 2, 'eд': 'шт.'}),
#     (3, {'название': 'сканер', 'цена': 2000, 'количество': 7, 'eд': 'шт.'}),
#     (4, {'название': 'мышка', 'цена': 500, 'количество': 17, 'eд': 'литров.'}),
# ]

# мышка 453 17 литров

goods = []
i = 0

print('Введите одной строкой: название товара, цену, количество, единицы измерения')
print('В качестве разделителя позиций используйте только один символ пробела')
print('Для завершения введите пустую строку')

while True:
    i += 1
    good_list = input(f'{i} товар: ').split(' ')
    if good_list == ['']:
        break
    goods.append((i, {'Наименование': good_list[0],
                      'Цена': good_list[1],
                      'Количество': good_list[2],
                      'Ед. изм.': good_list[3]}))

goods_dict = {}

for el in list(goods[0][1].keys()):
    goods_dict[el] = []

for el in goods_dict:
    dict_list = []
    for el_goods in goods:
        key_val = el_goods[1].get(el)
        if key_val not in dict_list:
            dict_list.append(key_val)
    goods_dict[el] = dict_list

print(goods_dict)


