# 2.	Для списка реализовать обмен значений соседних элементов.
# Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т. д.
# При нечётном количестве элементов последний сохранить на своём месте.
# Для заполнения списка элементов нужно использовать функцию input().


numbers = []
i = 0

while True:
    i += 1
    el_n = input(f'Введите {i}-й элемент списка: ')
    if el_n == '':
        break
    numbers.append(el_n)

i = 0

print('Исходный список: ', numbers)

while i < len(numbers):
    pop_el = numbers.pop(i)
    numbers.insert(i + 1, pop_el)
    i += 2

print('Измененный список: ', numbers)
