# 2.	Реализовать класс Road (дорога).
#
# ●	определить атрибуты: length (длина), width (ширина);
# ●	значения атрибутов должны передаваться при создании экземпляра класса;
# ●	атрибуты сделать защищёнными;
# ●	определить метод расчёта массы асфальта, необходимого для покрытия всей дороги;
# ●	использовать формулу: длина*ширина*масса асфальта для покрытия одного кв. метра дороги асфальтом, толщиной в 1 см*число см толщины полотна;
# ●	проверить работу метода.
#
# Например: 20 м*5000 м*25 кг*5 см = 12500 т.

class Road():
    __mass_1sqr = 0.025

    def __init__(self, length=1, width=1):
        self._length = length
        self._width = width
        print(f'Создан новый объект класса Road длиной {self._length} метров и шириной {self._width} метров')

    def calc_mass(self, height=1):
        self.height = height / 100
        return print(
            f'Масса асфальта дороги длиной={self._length} м., шириной={self._width} м., плотностью={self.__mass_1sqr} тн./кв.м и толщиной {height} см. = {int(self._length * self._width * self.__mass_1sqr * self.height)} тн.')


a = Road(5000, 20)
a.calc_mass(5)
